; domain
(define (domain gripper)
  (:requirements :strips :typing)
  (:types room ball gripper)

  (:predicates
    (at-robby ?r - room)
    (at ?b - ball ?r - room)
    (free ?g - gripper)
    (carry ?b - ball ?g - gripper)
  )

  (:action move
    :parameters (?from - room ?to - room)
    :precondition (at-robby ?from)
    :effect (and
      (not (at-robby ?from))
      (at-robby ?to))
  )

  (:action pick
    :parameters (?b - ball ?r - room ?g - gripper)
    :precondition (and
      (at-robby ?r)
      (at ?b ?r)
      (free ?g))
    :effect (and
      (not (at ?b ?r))
      (not (free ?g))
      (carry ?b ?g))
  )

  (:action drop
    :parameters (?b - ball ?r - room ?g - gripper)
    :precondition (and
      (at-robby ?r)
      (carry ?b ?g))
    :effect (and
      (at ?b ?r)
      (free ?g)
      (not (carry ?b ?g)))
  )
)

; problem
(define (problem gripper-r2-n6-p06)
  (:domain gripper)

  (:objects
    rooma roomb - room
    ball1 ball2 ball3 ball4 ball5 ball6 - ball
    left right - gripper
  )

  (:init
    (at-robby roomb)
    (at ball1 roomb)
    (at ball2 rooma)
    (at ball3 roomb)
    (at ball4 rooma)
    (at ball5 rooma)
    (at ball6 rooma)
    (free left)
    (free right)
  )

  (:goal
    (and
      (at ball1 roomb)
      (at ball2 roomb)
      (at ball3 roomb)
      (at ball4 roomb)
      (at ball5 roomb)
      (at ball6 roomb)
    )
  )
)

; plan
1. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 2 of 6
2. (pick ball2 rooma left)
   deleted: (at ball2 rooma) (free left)
   added: (carry ball2 left)
   goals met: 2 of 6
3. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 2 of 6
4. (drop ball2 roomb left)
   deleted: (carry ball2 left)
   added: (at ball2 roomb) (free left)
   goals met: 3 of 6
5. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 3 of 6
6. (pick ball4 rooma left)
   deleted: (at ball4 rooma) (free left)
   added: (carry ball4 left)
   goals met: 3 of 6
7. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 3 of 6
8. (drop ball4 roomb left)
   deleted: (carry ball4 left)
   added: (at ball4 roomb) (free left)
   goals met: 4 of 6
9. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 4 of 6
10. (pick ball5 rooma left)
   deleted: (at ball5 rooma) (free left)
   added: (carry ball5 left)
   goals met: 4 of 6
11. (pick ball6 rooma right)
   deleted: (at ball6 rooma) (free right)
   added: (carry ball6 right)
   goals met: 4 of 6
12. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 4 of 6
13. (drop ball5 roomb left)
   deleted: (carry ball5 left)
   added: (at ball5 roomb) (free left)
   goals met: 5 of 6
14. (drop ball6 roomb right)
   deleted: (carry ball6 right)
   added: (at ball6 roomb) (free right)
   goals met: 6 of 6
